openfoam/3D/transonic_naca0012_2degreeM0.75/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    aerofoil
    {
        type            calculated;
        value           nonuniform List<vector> 
6000
(
(-22.371127 0 -1.043943)
(-22.371127 0 -1.043943)
(-22.371127 0 -1.043943)
(-22.371127 0 -1.043943)
(-22.371127 0 -1.043943)
(-22.371127 0 -1.043943)
(-22.371127 0 -1.043943)
(-22.371127 0 -1.043943)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    back
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
}


// ************************************************************************* //
