openfoam/3D/transonic_naca0012_2degreeM0.75/system/samplePwall
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;
writeFields     true;

surfaceFormat   raw;
regionType      patch;
name            aerofoil;

operation       none;

fields
(
    p
    yPlus
    wallShearStress
);
